////////////////////////////////////////////////////////////////////////////////
/// @file           rb.c
/// @brief          汎用リングバッファ
/// @author         作成者
/// @date           2019.12.04
/// $Version:       V1.0$
/// $Revision:      R0.0$
/// @note           このライブラリでは、バッファそのものは扱わない。
///                 バッファのインデックスを操作するのみ
/// @attention      ファイルに注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
/// Copyright (c) YYYY Sample Inc. All Rights reserved.
///
/// - 本ソフトウェアの一部又は全てを無断で複写複製（コピー）することは、
///   著作権侵害にあたりますので、これを禁止します。
/// - 本製品の使用に起因する侵害または特許権その他権利の侵害に関しては
///   当社は一切その責任を負いません。
///
////////////////////////////////////////////////////////////////////////////////

/*****************************************************************************/
/*****************************************************************************/
/*  ヘッダファイルのインクルード                                              */
/*****************************************************************************/
/*****************************************************************************/
#include "../comm/typedef.h"

////////////////////////////////////////////////////////////////////////////////
/// @def    __TERMSIM_DEBUG__
/// @brief  PC上でのシミュレーションで有効にする。
////////////////////////////////////////////////////////////////////////////////
#define __TERMSIM_DEBUG__

#ifdef __TERMSIM_DEBUG__
#include <stdio.h>
#endif /*__TERMSIM_DEBUG__*/


/*****************************************************************************/
/*****************************************************************************/
/*  自ヘッダファイルのインクルード                                            */
#define __GLOBAL_DEFINE__
/*****************************************************************************/
#include "rb.h"


/*****************************************************************************/
/*****************************************************************************/
/* 型定義                                                                    */
/*****************************************************************************/
/*****************************************************************************/

////////////////////////////////////////////////////////////////////////////////
/// @typedef    typedef名
/// @brief      typedefの説明
///
////////////////////////////////////////////////////////////////////////////////



/*****************************************************************************/
/*****************************************************************************/
/* マクロ */
/*****************************************************************************/
/*****************************************************************************/
/////////////////////////////////////////////////////////////////////////////////
/// @def        define名
/// @brief      defineの説明
///
////////////////////////////////////////////////////////////////////////////////

#ifdef __TERMSIM_DEBUG__
/////////////////////////////////////////////////////////////////////////////////
/// @def        TEST_RB_LEN
/// @brief      テスト用のバッファサイズ
///
////////////////////////////////////////////////////////////////////////////////
#define     TEST_RB_LEN 16
#endif /* __TERMSIM_DEBUG__ */

/*****************************************************************************/
/*****************************************************************************/
/* クラス */
/*****************************************************************************/
/*****************************************************************************/

///////////////////////////////////////////////////////////////////////////////
/// @class      class名
/// @brief      classの説明
///
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/// @struct     構造体名
/// @brief      構造体の説明
///
////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
/// @enum       enum型名
/// @brief      enum型の説明
///
////////////////////////////////////////////////////////////////////////////////

/*****************************************************************************/
/*****************************************************************************/
/* 変数定義 */
/*****************************************************************************/
/*****************************************************************************/

////////////////////////////////////////////////////////////////////////////////
/// @var        変数名
/// @brief      変数の説明
///
////////////////////////////////////////////////////////////////////////////////

/*****************************************************************************/
/*****************************************************************************/
/* 内部関数宣言 */
/*****************************************************************************/
/*****************************************************************************/
#ifdef __TERMSIM_DEBUG__
static void vds_lib_rb_mon(st_lib_rblist stt_rbst);
#endif /* __TERMSIM_DEBUG__ */

/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 関数定義 */
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/

/*****************************************************************************/
/*****************************************************************************/
/* グローバル関数定義 */
/*****************************************************************************/
/*****************************************************************************/
////////////////////////////////////////////////////////////////////////////////
/// @brief          vdg_lib_rb_Init
/// @fn             バッファ制御の初期化
/// @param[in]      (u2t_sizemax)   バッファサイズ
/// @param[out]     (stt_rb)        バッファの構造体
/// @return         なし
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           関数に備考などを明記する場合はここへ書き込む
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
void vdg_lib_rb_Init(st_lib_rblist* stt_rb, const u2 u2t_sizemax)
{
    stt_rb->u2_head = 0;
    stt_rb->u2_tail = 0;
    stt_rb->s4_use = 0;
    stt_rb->u2_sizemax = u2t_sizemax;
    stt_rb->en_rbst = LIB_RB_RBEMPTY;
}


////////////////////////////////////////////////////////////////////////////////
/// @brief          u2g_lib_rb_Enque
/// @fn             バッファに入れる
/// @param[out]     (stt_rb)        バッファ制御用の構造体
/// @return         バッファエンキュー用インデックス
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           buffer[u2g_lib_rb_Enque(&stt_rb)] = 1234;
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
u2 u2g_lib_rb_Enque(st_lib_rblist* stt_rb)
{
    u2 u2t_head;
    u2 u2t_tail;
    s4 s4t_use;
    u2 u2t_sizemax;
    en_lib_rb_rbState ent_st;
    u2t_head    = stt_rb->u2_head;
    u2t_tail    = stt_rb->u2_tail;
    s4t_use     = stt_rb->s4_use;
    u2t_sizemax = stt_rb->u2_sizemax;
    /// 先端を進める
    u2t_head = (u2t_head + 1) % u2t_sizemax;

    if (ent_st == LIB_RB_RBFULL)
    {
        /// バッファがフルを超えていたら後端もずらす。
        u2t_tail++;
    }

    /// バッファがフルか判定する。
    if (s4t_use >= (u2t_sizemax -1))
    {
        ent_st = LIB_RB_RBFULL;
    }
    /// バッファが空か判定する。
    else if (s4t_use <= 0)
    {
        /// 使用サイズを増やす
        s4t_use++;
        ent_st = LIB_RB_RBEMPTY;
    }
    else
    {
        /// 使用サイズを増やす
        s4t_use++;
        ent_st = LIB_RB_RBNONEMPFLL;
    }
    stt_rb->u2_head = u2t_head;
    stt_rb->u2_tail = u2t_tail;
    stt_rb->s4_use = s4t_use;
    stt_rb->en_rbst = ent_st;
    return u2t_head;
}

////////////////////////////////////////////////////////////////////////////////
/// @brief          u2g_lib_rb_Deque
/// @fn             バッファから取り出す
/// @param[out]     (stt_rb)        バッファ制御用の構造体
/// @return         バッファデキュー用インデックス
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           temp = buffer[u2g_lib_rb_Enque(&stt_rb)];
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
u2  u2g_lib_rb_Deque(st_lib_rblist* stt_rb)
{
    u2 u2t_head;
    u2 u2t_tail;
    s4 s4t_uselen;
    u2 u2t_size;
    en_lib_rb_rbState ent_rbst;

    u2t_head = stt_rb->u2_head;
    u2t_tail = stt_rb->u2_tail;
    s4t_uselen = stt_rb->s4_use;
    u2t_size = stt_rb->u2_sizemax;

    u2t_tail = (u2t_tail + 1) % u2t_size;
    if (ent_rbst == LIB_RB_RBEMPTY)
    {
        /// バッファがエンプティを超えていたら先端もずらす
        u2t_head++;
    }

    if (s4t_uselen <= 0)
    {
        ent_rbst = LIB_RB_RBEMPTY;
    }
    else if (s4t_uselen >= (u2t_size -1))
    {
        ent_rbst = LIB_RB_RBFULL;
        s4t_uselen--;
    }
    else
    {
        s4t_uselen--;
        ent_rbst = LIB_RB_RBNONEMPFLL;
    }
    stt_rb->u2_head = u2t_head;
    stt_rb->u2_tail = u2t_tail;
    stt_rb->s4_use = s4t_uselen;
    stt_rb->en_rbst = ent_rbst;
    return u2t_tail;
}



////////////////////////////////////////////////////////////////////////////////
/// @brief          eng_lib_rb_stRead
/// @fn             バッファの状態を読み出す
/// @param[in]      (stt_rb)        バッファ制御用の構造体
/// @return         バッファの状態
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           特になし
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
en_lib_rb_rbState  eng_lib_rb_stRead(st_lib_rblist stt_rb)
{
    return stt_rb.en_rbst;
}

////////////////////////////////////////////////////////////////////////////////
/// @brief          vdg_lib_rb_stFwrite
/// @fn             バッファの状態を強制的に設定する
/// @param[out]     (stt_rb)        バッファ制御用の構造体
/// @param[in]      (ent_st)        バッファに書き込む状態
/// @return         バッファの状態
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           特になし
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
void vdg_lib_rb_stFwrite(st_lib_rblist* stt_rb, en_lib_rb_rbState ent_st)
{
    stt_rb->en_rbst = ent_st;
}

////////////////////////////////////////////////////////////////////////////////
/// @brief          u2g_lib_rb_read
/// @fn             バッファの先頭をデキューせず読み出す。
/// @param[in]     (stt_rb)        バッファ制御用の構造体
/// @param[in]     (u2t_past)      バッファを遡る長さ
/// @return         バッファインデックス
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           temp = buffer[u2g_lib_rb_Enque(&stt_rb)];
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
u2 u2g_lib_rb_read(const st_lib_rblist stt_rblist, u2 u2t_past)
{
    u2 u2t_head;
    u2 u2t_tail;
    u2 u2t_pasttmp;
    u2 u2t_index;
    s4 s4t_uselen;
    u2 u2t_size;

    u2t_head = stt_rblist.u2_head;
    u2t_tail = stt_rblist.u2_tail +1;
    s4t_uselen = stt_rblist.s4_use;
    u2t_size = stt_rblist.u2_sizemax;
    if (u2t_past >= (s4t_uselen))
    {
        u2t_pasttmp = (s4t_uselen -1);
    }
    else
    {
        u2t_pasttmp = u2t_past;
    }
    
    u2t_index = (u2t_tail + u2t_pasttmp) % u2t_size;
    return u2t_index;   

}

////////////////////////////////////////////////////////////////////////////////
/// @brief          vdg_lib_rb_stUpdate
/// @fn             バッファ状態を更新する
/// @param[out]     (stt_rb)        バッファ制御用の構造体
/// @return         void
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           temp = buffer[u2g_lib_rb_Enque(&stt_rb)];
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
void vdg_lib_rb_stUpdate(st_lib_rblist* stt_rbst)
{
    s4 s4t_uselen;
    u2 u2t_size;
    en_lib_rb_rbState ent_rbst;

    s4t_uselen = stt_rbst->s4_use;
    u2t_size = stt_rbst->u2_sizemax;
    ent_rbst = stt_rbst->en_rbst;
    
    if (s4t_uselen <= 0)
    {
        ent_rbst = LIB_RB_RBEMPTY;
    }
    else if (s4t_uselen >= (u2t_size -1))
    {
        ent_rbst = LIB_RB_RBFULL;
    }
    else
    {
        ent_rbst = LIB_RB_RBNONEMPFLL;
    }
    stt_rbst->en_rbst = ent_rbst;
}


/////////////////////////////////////////////////////////////////////////////////
/// テスト用のmain関数

#ifdef __TERMSIM_DEBUG__
////////////////////////////////////////////////////////////////////////////////
/// @brief          main
/// @fn             テスト用メイン関数
/// @param[in]      引数(参照専用)
/// @param[out]     引数(ポインタ引数等)
/// @return         関数戻り値の説明
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           関数に備考などを明記する場合はここへ書き込む
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
int main(int argc, char* argv)
{
    int cnt;
    st_lib_rblist stt_rblist;
    char cht_buffer[TEST_RB_LEN];

    printf("Init RB\n");
    vdg_lib_rb_Init(&stt_rblist, TEST_RB_LEN);

    printf("Enque!\n");
    while(eng_lib_rb_stRead(stt_rblist) != LIB_RB_RBFULL)
    {
        cht_buffer[u2g_lib_rb_Enque(&stt_rblist)] =  'a' + (cnt % 29);
        cnt++;
    }

    printf("[");
    for (cnt = 0; cnt < TEST_RB_LEN; cnt++)
    {
        printf("%c, ", cht_buffer[cnt]);
    }
    printf("]\n");

    cnt = 0;
    printf("Deque!\n");
    while(eng_lib_rb_stRead(stt_rblist) != LIB_RB_RBEMPTY)
    {
        printf("%d,%c\n",cnt,cht_buffer[u2g_lib_rb_Deque(&stt_rblist)]);
        cnt++;
    }  

    cnt = 0;
    printf("Enque\n");
    while(eng_lib_rb_stRead(stt_rblist) != LIB_RB_RBFULL)
    {
        cht_buffer[u2g_lib_rb_Enque(&stt_rblist)] =  'A' + (cnt % 29);
        cnt++;
    }
    printf("OverWrite!\n");
    /// OverWrite
    for (cnt = 0; cnt < 5; cnt++)
    {
        cht_buffer[u2g_lib_rb_Enque(&stt_rblist)] =  '0' + (cnt % 10);
    }
    
    printf("[");
    for (cnt = 0; cnt < TEST_RB_LEN; cnt++)
    {
        printf("%c, ", cht_buffer[cnt]);
    }
    printf("]\n");

    cnt = 0;
    while(eng_lib_rb_stRead(stt_rblist) != LIB_RB_RBEMPTY)
    {
        printf("%d,%c\n",cnt,cht_buffer[u2g_lib_rb_Deque(&stt_rblist)]);
        cnt++;
    }
    vds_lib_rb_mon(stt_rblist);
    printf("Only Read Test\n");
    for (cnt = 0; cnt < 5; cnt++)
    {
        cht_buffer[u2g_lib_rb_Enque(&stt_rblist)] =  '!' + cnt;
    }
    vds_lib_rb_mon(stt_rblist);
    printf("[");
    for (cnt = 0; cnt < TEST_RB_LEN; cnt++)
    {
        printf("%c, ", cht_buffer[cnt]);
    }
    printf("]\n");
    for (cnt = 0; cnt < 8; cnt++)
    {
        printf("%d,%c\n",cnt,cht_buffer[u2g_lib_rb_read(stt_rblist,cnt)]);
    }

    printf("Fwrite and update chek\n");
    vds_lib_rb_mon(stt_rblist);
    vdg_lib_rb_stFwrite(&stt_rblist, LIB_RB_RBFULL);
    vds_lib_rb_mon(stt_rblist);
    vdg_lib_rb_stFwrite(&stt_rblist, LIB_RB_RBEMPTY);
    vds_lib_rb_mon(stt_rblist);
    vdg_lib_rb_stUpdate(&stt_rblist);
    vds_lib_rb_mon(stt_rblist);

    return 0;
}

#endif /* __TERMSIM_DEBUG__ */

/*****************************************************************************/
/*****************************************************************************/
/* 内部関数定義 */
/*****************************************************************************/
/*****************************************************************************/

#ifdef __TERMSIM_DEBUG__
////////////////////////////////////////////////////////////////////////////////
/// @brief          モニタ用テスト関数
/// @fn             vds_lib_rb_mon
/// @param[in]      stt_rbst 
/// @return         関数戻り値の説明
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           関数に備考などを明記する場合はここへ書き込む
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
void vds_lib_rb_mon(st_lib_rblist stt_rbst)
{
    printf ("head = %d, tail = %d, size = %d, use = %d, ",      stt_rbst.u2_head, 
                                                                stt_rbst.u2_tail, 
                                                                stt_rbst.u2_sizemax, 
                                                                stt_rbst.s4_use);
    if      (stt_rbst.en_rbst == LIB_RB_RBEMPTY)
    {
        printf("state = EMPTY");
    }
    else if (stt_rbst.en_rbst == LIB_RB_RBFULL)
    {
        printf("state = FULL");
    }
    else
    {
        printf("state = NOT FULL/EMPTY");
    }
    printf("\n");
    
}
#endif /* __TERMSIM_DEBUG__ */

/*********************EOF******************************************************/