////////////////////////////////////////////////////////////////////////////////
/// @file           sys_boot.c
/// @brief          ファイルの説明
/// @author         作成者
/// @date           ファイル作成年月日
/// $Version:       ファイルバージョン$
/// $Revision:      ファイルリビジョン$
/// @note           ファイルに備考などを明記する場合はここへ書き込む
/// @attention      ファイルに注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
/// Copyright (c) YYYY Sample Inc. All Rights reserved.
///
/// - 本ソフトウェアの一部又は全てを無断で複写複製（コピー）することは、
///   著作権侵害にあたりますので、これを禁止します。
/// - 本製品の使用に起因する侵害または特許権その他権利の侵害に関しては
///   当社は一切その責任を負いません。
///
////////////////////////////////////////////////////////////////////////////////

/*****************************************************************************/
/*****************************************************************************/
/*  ヘッダファイルのインクルード                                              */
/*****************************************************************************/
/*****************************************************************************/
#include <Arduino.h>

/*****************************************************************************/
/*****************************************************************************/
/*  自ヘッダファイルのインクルード                                            */
#define __GLOBAL_DEFINE__
/*****************************************************************************/
#include "boot.h"


/*****************************************************************************/
/*****************************************************************************/
/* 型定義                                                                    */
/*****************************************************************************/
/*****************************************************************************/

////////////////////////////////////////////////////////////////////////////////
/// @typedef    typedef名
/// @brief      typedefの説明
///
////////////////////////////////////////////////////////////////////////////////



/*****************************************************************************/
/*****************************************************************************/
/* マクロ */
/*****************************************************************************/
/*****************************************************************************/
/////////////////////////////////////////////////////////////////////////////////
/// @def        define名
/// @brief      defineの説明
///
////////////////////////////////////////////////////////////////////////////////

/*****************************************************************************/
/*****************************************************************************/
/* クラス */
/*****************************************************************************/
/*****************************************************************************/

///////////////////////////////////////////////////////////////////////////////
/// @class      class名
/// @brief      classの説明
///
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/// @struct     構造体名
/// @brief      構造体の説明
///
////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
/// @enum       enum型名
/// @brief      enum型の説明
///
////////////////////////////////////////////////////////////////////////////////

/*****************************************************************************/
/*****************************************************************************/
/* 変数定義 */
/*****************************************************************************/
/*****************************************************************************/

////////////////////////////////////////////////////////////////////////////////
/// @var        変数名
/// @brief      変数の説明
///
////////////////////////////////////////////////////////////////////////////////

/*****************************************************************************/
/*****************************************************************************/
/* 内部関数宣言 */
/*****************************************************************************/
/*****************************************************************************/

/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/* 関数定義 */
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/

/*****************************************************************************/
/*****************************************************************************/
/* グローバル関数定義 */
/*****************************************************************************/
/*****************************************************************************/

////////////////////////////////////////////////////////////////////////////////
/// @brief          関数の説明
/// @fn             関数名
/// @param[in]      引数(参照専用)
/// @param[out]     引数(ポインタ引数等)
/// @return         関数戻り値の説明
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           関数に備考などを明記する場合はここへ書き込む
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
void vdg_sys_boot_basicInit(void)
{
}

////////////////////////////////////////////////////////////////////////////////
/// @brief          関数の説明
/// @fn             関数名
/// @param[in]      引数(参照専用)
/// @param[out]     引数(ポインタ引数等)
/// @return         関数戻り値の説明
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           関数に備考などを明記する場合はここへ書き込む
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
void vdg_sys_boot_mainInit(void)
{
    // u16 agndvol;
    // pinMode(PNCF_CTRL_ENIRLED, OUTPUT);
    // vdg_sac_ctrl_irldosc_DI();
    // pinMode(PNCF_UI_SP, OUTPUT);

    // agndvol = u16g_drv_dac7614_convf(2.50);
    // vdg_drv_dac7614_setup();
    // vdg_drv_dac7614_start();
    // vdg_drv_dac7614_output(PNCF_DAC7614_SPDTRGT, agndvol);
    // vdg_drv_dac7614_output(PNCF_DAC7614_CTRL_STRTRGT, agndvol);
    // vdg_drv_dac7614_output(PNCF_DAC7614_CTRL_IL, agndvol);
    // vdg_drv_dac7614_output(PNCF_DAC7614_CTRL_IR, agndvol);
    // vdg_drv_dac7614_end();

    // vdg_drv_mcp320x_setup(DRV_MCP3208_CH);

    // //Serial.begin(9600);
    // //Serial.print("# RedSpecial BOOT !!");
    // vdg_sys_intr_fastintv_setup();
}

////////////////////////////////////////////////////////////////////////////////
/// @brief          関数の説明
/// @fn             関数名
/// @param[in]      引数(参照専用)
/// @param[out]     引数(ポインタ引数等)
/// @return         関数戻り値の説明
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           関数に備考などを明記する場合はここへ書き込む
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
void vdg_sys_boot_aplInit(void)
{
///    vdg_app_ui_Setup();
}

////////////////////////////////////////////////////////////////////////////////
/// @brief          関数の説明
/// @fn             関数名
/// @param[in]      引数(参照専用)
/// @param[out]     引数(ポインタ引数等)
/// @return         関数戻り値の説明
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           関数に備考などを明記する場合はここへ書き込む
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////
void vdg_sys_boot_chkstp(void)
{
    // en_sac_sys_btryst  ent_btrst;
    // ent_btrst = eng_sac_sys_btrychk();
    
    // if (ent_btrst == EMPTYVOLTAGE)
    // {
    //     while(1)
    //     {
    //         digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_ON);
    //         digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_OFF);
    //         digitalWrite(PNCF_UI_WTLED, HIGH);
    //         vdg_sac_ui_tone_WRN();
    //         delay(100);
    //         digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_OFF);
    //         digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_ON);
    //         digitalWrite(PNCF_UI_WTLED, LOW);
    //         vdg_sac_ui_tone_WRN();
    //         delay(100);
    //         Serial.print("EMPTY BATTERY!!");
    //     }
    // }
    // else if (ent_btrst == LOWVOLTAGE)
    // {
    //     digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_ON);
    //     digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_OFF);
    //     digitalWrite(PNCF_UI_WTLED, HIGH);
    //     vdg_sac_ui_tone_piroD();
    //     delay(100);
    //     digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_OFF);
    //     digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_ON);
    //     digitalWrite(PNCF_UI_WTLED, LOW);
    //     vdg_sac_ui_tone_piroD();
    //     delay(100);
    //     Serial.print("LOW BATTERY!!");
    // }
    // else if (ent_btrst == MIDVOLTAGE)
    // {
    //     digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_ON);
    //     digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_OFF);
    //     digitalWrite(PNCF_UI_WTLED, HIGH);
    //     vdg_sac_ui_tone_piroU();
    //     delay(100);
    //     digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_OFF);
    //     digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_ON);
    //     digitalWrite(PNCF_UI_WTLED, LOW);
    //     vdg_sac_ui_tone_piroU();
    //     delay(100);
    //     Serial.print("MID BATTERY");
    // }
    // else if (ent_btrst == FULLVOLTAGE)
    // {
    //     digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_ON);
    //     digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_ON);
    //     digitalWrite(PNCF_UI_WTLED, HIGH);
    //     vdg_sac_ui_tone_pi();
    //     delay(50);
    //     digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_OFF);
    //     digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_OFF);
    //     digitalWrite(PNCF_UI_WTLED, LOW);
    //     vdg_sac_ui_tone_pi();
    //     delay(50);
    //     digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_ON);
    //     digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_ON);
    //     digitalWrite(PNCF_UI_WTLED, HIGH);
    //     vdg_sac_ui_tone_pi();
    //     delay(50);
    //     digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_OFF);
    //     digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_OFF);
    //     digitalWrite(PNCF_UI_WTLED, LOW);
    //     vdg_sac_ui_tone_pi();
    //     delay(50);  
    //     Serial.print("FULL BATTERY");
    // }
    // else
    // {
    //     digitalWrite(PNCF_UI_GREENLED, PNCF_UI_GREENLED_ON);
    //     digitalWrite(PNCF_UI_REDLED, PNCF_UI_REDLED_ON);
    //     digitalWrite(PNCF_UI_WTLED, HIGH);
    //     tone(PNCF_UI_SP, 4000);
    //     while(1){/** NOP **/}
    // }
    
}

/*****************************************************************************/
/*****************************************************************************/
/* 内部関数定義 */
/*****************************************************************************/
/*****************************************************************************/

////////////////////////////////////////////////////////////////////////////////
/// @brief          関数の説明
/// @fn             関数名
/// @param[in]      引数(参照専用)
/// @param[out]     引数(ポインタ引数等)
/// @return         関数戻り値の説明
/// @author         関数作成者名
/// @date           関数作成年月日
/// @version        関数やソースにバージョンを明記する場合はここへ書き込む
/// @note           関数に備考などを明記する場合はここへ書き込む
/// @attention      関数に注意書きなどを明記する場合はここへ書き込む
/// @par            History
///                 ファイルに履歴などを明記する場合はここへ書き込む
///
////////////////////////////////////////////////////////////////////////////////

/*********************EOF******************************************************/